#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Acquiring state lock. This may take a few moments...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

azuread_group.k8s_administrators: Refreshing state... [id=f453d3b2-44fe-4359-83cc-1328bcf53d27]
azurerm_resource_group.k8s_rg: Refreshing state... [id=/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourceGroups/demo-k8s-rg]
azurerm_log_analytics_workspace.k8s_monitor: Refreshing state... [id=/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/microsoft.operationalinsights/workspaces/demo-k8s-monitor]
azurerm_kubernetes_cluster.k8s_cluster: Refreshing state... [id=/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/Microsoft.ContainerService/managedClusters/demo-k8s]
azurerm_kubernetes_cluster_node_pool.k8s_nodepool_dev: Refreshing state... [id=/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/Microsoft.ContainerService/managedClusters/demo-k8s/agentPools/devtest]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster_node_pool.k8s_nodepool_dev will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "k8s_nodepool_dev" {
        availability_zones    = [
            "1",
            "2",
            "3",
        ]
        enable_auto_scaling   = true
        enable_node_public_ip = false
        id                    = "/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/Microsoft.ContainerService/managedClusters/demo-k8s/agentPools/devtest"
        kubernetes_cluster_id = "/subscriptions/5c8f3e12-757e-4183-a8d0-80effb7bf97f/resourcegroups/demo-k8s-rg/providers/Microsoft.ContainerService/managedClusters/demo-k8s"
      ~ max_count             = 3 -> 10
        max_pods              = 110
      ~ min_count             = 0 -> 1
        mode                  = "User"
        name                  = "devtest"
        node_count            = 1
        node_labels           = {}
        node_taints           = [
            "environment=devtest:NoSchedule",
        ]
        orchestrator_version  = "1.17.13"
        os_disk_size_gb       = 128
        os_type               = "Linux"
        priority              = "Regular"
        spot_max_price        = -1
        tags                  = {
            "environment" = "devtest"
        }
        vm_size               = "Standard_D2s_v4"
    }

  # azurerm_user_assigned_identity.k8s_uami will be created
  + resource "azurerm_user_assigned_identity" "k8s_uami" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "demo-k8s-rg"
      + name                = "demo-k8s-uami"
      + principal_id        = (known after apply)
      + resource_group_name = "southeastasia"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
```
</details>s
*Pusher: @SatyKrish, Action: `pull_request`*